# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# neck增加pan，并修改融合
# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [4,5, 8,10, 22,18]  # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[2, 1, Conv, [32, 1, 1]], #10
   [4, 1, Conv, [64, 1, 1]], 
   [6, 1, Conv, [128, 1, 1]], 
   [9, 1, Conv, [256, 1, 1]], #13
   
   [[10, 11, 12, 13], 1, ASFF_4, [32, 0]],
   [[10, 11, 12, 13], 1, ASFF_4, [64, 1]], 
   [[10, 11, 12, 13], 1, ASFF_4, [128, 2]],
   [[10, 11, 12, 13], 1, ASFF_4, [256, 3]], #17
   
   [-4, 1, BasicBlock_n, [32]], #18
   [-4, 1, BasicBlock_n, [64]], 
   [-4, 1, BasicBlock_n, [128]],
   [-4, 1, BasicBlock_n, [256]], #21
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 20], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [128, False]],  # 25

   [-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 19], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [64, False]],  # 29 
   
   [-1, 1, Conv, [32, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 18], 1, Concat, [1]],  #  
   [-1, 3, C3, [32, False]],  # 33 (p2/4)
   
   [[33, 29, 25], 1, ASFF_3, [32, 0]], 
   [[33, 29, 25], 1, ASFF_3, [64, 1]],
   [[33, 29, 25], 1, ASFF_3, [128, 2]], #36 
   
   [-3, 1, BasicBlock_n, [32]], #37
   [-3, 1, BasicBlock_n, [64]],
   [-3, 1, BasicBlock_n, [128]],  
         
   [[37, 38], 1, ASFF_2, [32, 0]], #40
   [[37, 38], 1, ASFF_2, [64, 1]], 
   
   [-2, 1, BasicBlock_n, [32]], #42
   [-2, 1, BasicBlock_n, [64]],  
   
   [-2, 1, Conv, [128, 1, 1]], #44
   [-2, 1, Conv, [256, 1, 1]], 
   [39, 1, Conv, [512, 1, 1]],
   [21, 1, Conv, [1024, 1, 1]],
   
   [[44, 45, 46, 47], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
