# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# yolov5的neck修改为4个head的afpn origal结构
# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [4,5, 8,10, 22,18]  # P2/4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[2, 1, Conv, [32, 1, 1]], #10
   [4, 1, Conv, [64, 1, 1]], 
   [6, 1, Conv, [128, 1, 1]], 
   [9, 1, Conv, [256, 1, 1]], #13
   
   [-4, 1, Conv, [32, 1, 1]], #14
   [-4, 1, Conv, [64, 1, 1]], #15
   [-4, 1, Conv, [128, 1, 1]], 
   [-4, 1, Conv, [256, 1, 1]], #17
 
   [[14, 15], 1, ASFF_2, [32, 0]], 
   [[14, 15], 1, ASFF_2, [64, 1]], 
 
   [-2, 9, BasicBlock_n, [32]], #20
   [-2, 9, BasicBlock_n, [64]],  
 
   [[20, 21, 16], 1, ASFF_3, [32, 0]],
   [[20, 21, 16], 1, ASFF_3, [64, 1]],
   [[20, 21, 16], 1, ASFF_3, [128, 2]], #24

   [-3, 9, BasicBlock_n, [32]], #25
   [-3, 9, BasicBlock_n, [64]],
   [-3, 9, BasicBlock_n, [128]],
   
   [[25, 26, 27, 17], 1, ASFF_4, [32, 0]],
   [[25, 26, 27, 17], 1, ASFF_4, [64, 1]], 
   [[25, 26, 27, 17], 1, ASFF_4, [128, 2]],
   [[25, 26, 27, 17], 1, ASFF_4, [256, 3]], #31
   
   [-4, 9, BasicBlock_n, [32]], #32
   [-4, 9, BasicBlock_n, [64]], 
   [-4, 9, BasicBlock_n, [128]],
   [-4, 9, BasicBlock_n, [256]], #35
 
   [-4, 1, Conv, [128, 1, 1]], #36
   [-4, 1, Conv, [256, 1, 1]], 
   [-4, 1, Conv, [512, 1, 1]],
   [-4, 1, Conv, [1024, 1, 1]],

   [[36, 37, 38, 39], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
