# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[4, 1, Conv, [64, 1, 1]], #10
   [6, 1, Conv, [128, 1, 1]], 
   [9, 1, Conv, [256, 1, 1]], #12
   
   [-3, 1, Conv, [64, 1, 1]], #13
   [-3, 1, Conv, [128, 1, 1]], 
   [-3, 1, Conv, [256, 1, 1]], #15
 
   [[13, 14], 1, ASFF_2, [64, 0]], 
   [[13, 14], 1, ASFF_2, [128, 1]], 
 
   [-2, 9, BasicBlock_n, [64]], #18
   [-2, 9, BasicBlock_n, [128]],  
 
   [[18, 19, 15], 1, ASFF_3, [64, 0]],
   [[18, 19, 15], 1, ASFF_3, [128, 1]],
   [[18, 19, 15], 1, ASFF_3, [256, 2]], #22

   [-3, 9, BasicBlock_n, [64]], #23
   [-3, 9, BasicBlock_n, [128]],
   [-3, 9, BasicBlock_n, [256]],
 
   [-3, 1, Conv, [256, 1, 1]], #26
   [-3, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [1024, 1, 1]],

   [[26, 27, 28], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
