# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Vitcov, [256]],  # 0-P1/2
   [-1, 1, EfficientViTBlock, [256, 2, 80, 7]],  # 1-P2/4
   [-1, 1, Vitsubsample, [512, 40]],
   [-1, 1, EfficientViTBlock, [512, 4, 40, 7]],  # 3-P3/8
   [-1, 1, EfficientViTBlock, [512, 4, 40, 7]],
   [-1, 1, Vitsubsample, [1024, 20]],  # 5-P4/16
   [-1, 9, EfficientViTBlock, [1024, 8, 20, 7]],  # 6
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 10

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 14 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 17 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 7], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 20 (P5/32-large)

   [[14, 17, 20], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
